frontend/controllers/SiteController.php

    public function successCallback($client)
{
    $attributes = $client->getUserAttributes();


        // user login or signup comes here
        /*
        Checking facebook email registered yet?
        Maxsure your registered email when login same with facebook email
        die(print_r($attributes));
        */

        $user = User::find()->where(['email'=>$attributes['email']])->one();
---
SELECT * FROM `user` WHERE `email`='eloustah@gmail.com'

            $user->img=$user->img['data']['url'];
            $user->birthday=$session['attributes']['last_name'];

            $user->insert();

            $user = User::find()->where(['email'=>$attributes['email']])->one();
---
INSERT INTO `user` (`username`, `firstname`, `lastname`, `email`, `img`, `birthday`) VALUES ('Majnon Menk', 'Majnon', 'Menk', 'eloustah@gmail.com', 'https://scontent.xx.fbcdn.net/v/t1.0-1/p50x50/1653668_265996736935056_8290258459067309060_n.jpg?oh=bdebd6d180e4a71f1879f523fff7fb77&oe=5A15A1C6', 'Menk')
SELECT EXISTS(SELECT * FROM `user` WHERE (`user`.`email`='eloustah@gmail.com'))
SELECT * FROM `user` WHERE `email`='eloustah@gmail.com'